Catalogs/бит_ШаблоныПаспортаДома.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныПаспортаДома</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатьиПаспортаДома.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиПаспортаДома</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатьиПаспортаДомаСлужебный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиПаспортаДомаСлужебный</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_ШаблоныПаспортаДома</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиПаспортаДома</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ШаблоныПаспортаДома/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура проверяет записан ли элемент справочника бит_Бюджеты,
// если он новый перед началом добавления строк в табличные части.
//
// Возращаемое значение:
//   Булево - разрешено добавлять элементы в табличное поле.
//
&НаКлиенте
Функция ПроверитьВозможностьДобавленияЭлементов()

	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала необходимо записать элемент!");
		
		Разрешено = Ложь;
		
	Иначе	
		
		Разрешено = Истина;
		
	КонецЕсли;
	
	Возврат Разрешено;

КонецФункции // ПроверитьВозможностьДобавленияЭлементов()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отбор = СтатьиСметы.Отбор.Элементы;
	
	ОтборПоВладельцу = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоВладельцу.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ОтборПоВладельцу.ПравоеЗначение = Объект.Ссылка;
	ОтборПоВладельцу.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВладельцу.Использование  = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	                                                                                
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_СтатьиПаспортаДома.Форма.ФормаВыбораГруппы" Тогда
		
		ЗаполнитьСтатьиСметы(ВыбранноеЗначение, Объект.Ссылка);
		
		Элементы.СтатьиСметы.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Если Не Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_СтатьиПаспортаДома.Форма.ФормаВыбора", ПараметрыФормы, Элементы.СтатьиСметы,,,, Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Завершение = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСтатейОборотов(Команда)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Если Не Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_СтатьиПаспортаДома.Форма.ФормаВыбораГруппы", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСтатьиСметы

&НаКлиенте
Процедура СтатьиСметыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Отказ = Не Разрешено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиСметыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если  ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_СтатьиПаспортаДома") Тогда
		
		СоздатьСтатьюСметы(ВыбранноеЗначение, Объект.Ссылка);
		
	КонецЕсли; 
	
	Элементы.СтатьиСметы.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура создаёт и записывает новую статью бюджета.
//
// Параметры:
//  СтатьяОборотов  - СправочникСсылка.бит_СтатьиОборотов.
//  Параметр2  	 	- СправочникСсылка.бит_Бюджеты.
//
&НаСерверебезКонтекста
Процедура СоздатьСтатьюСметы(СтатьяОборотов, Смета)

	НоваяСтатьяСметы = Справочники.бит_СтатьиПаспортаДомаСлужебный.СоздатьЭлемент();
	
	НоваяСтатьяСметы.Владелец 		    = Смета;
	НоваяСтатьяСметы.СтатьяОборотов     = СтатьяОборотов;
	НоваяСтатьяСметы.Наименование 	    = СтатьяОборотов.Наименование;
	НоваяСтатьяСметы.НаименованиеПолное = СтатьяОборотов.НаименованиеПолное;
	НоваяСтатьяСметы.Кодификатор 	    = СтатьяОборотов.Кодификатор;
	
	НоваяСтатьяСметы.Записать();
	
КонецПроцедуры // СоздатьСтатьюБюджета(ВыбранноеЗначение)()

&НаСерверебезКонтекста
Процедура ЗаполнитьСтатьиСметы(ГруппаСтатейОборотов, Смета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ГруппаСтатейОборотов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	бит_СтатьиОборотов.ЭтоГруппа,
	|	бит_СтатьиОборотов.Наименование,
	|	бит_СтатьиОборотов.НаименованиеПолное,
	|	бит_СтатьиОборотов.Кодификатор,
	|	ЗНАЧЕНИЕ(Справочник.бит_СтатьиПаспортаДомаСлужебный.ПустаяСсылка) КАК РодительСтатьиСметы
	|ИЗ
	|	Справочник.бит_СтатьиПаспортаДома КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&Родитель)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	НачатьТранзакцию();
	
	ОбойтиИерархиюСтатейОборотов(ДеревоРезультат, Смета);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСерверебезКонтекста
Процедура ОбойтиИерархиюСтатейОборотов(Дерево, Смета)
	
	Для каждого СтрокаТаблицы Из Дерево.Строки Цикл
		
		Если СтрокаТаблицы.ЭтоГруппа Тогда
			НоваяСтатьяСметы = Справочники.бит_СтатьиПаспортаДомаСлужебный.СоздатьГруппу();
		Иначе
			НоваяСтатьяСметы = Справочники.бит_СтатьиПаспортаДомаСлужебный.СоздатьЭлемент();
			НоваяСтатьяСметы.НаименованиеПолное = СтрокаТаблицы.НаименованиеПолное;
		КонецЕсли; 
		
		НоваяСтатьяСметы.Владелец       = Смета;
		НоваяСтатьяСметы.Кодификатор    = СтрокаТаблицы.Кодификатор;
		НоваяСтатьяСметы.Наименование   = СтрокаТаблицы.Наименование;
		НоваяСтатьяСметы.СтатьяОборотов = СтрокаТаблицы.Ссылка;
		
		Если НЕ СтрокаТаблицы.Родитель = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.Родитель.РодительСтатьиСметы) 
				И СтрокаТаблицы.Родитель.РодительСтатьиСметы.ЭтоГруппа Тогда
				НоваяСтатьяСметы.Родитель = СтрокаТаблицы.Родитель.РодительСтатьиСметы;
			КонецЕсли;
		КонецЕсли; 
		
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(НоваяСтатьяСметы,,"Все");
		Если ДействиеВыполнено Тогда
			
			// Если запись выполнена - запомним приемник для последующего заполнения иерархии.
			СтрокаТаблицы.РодительСтатьиСметы = НоваяСтатьяСметы.Ссылка;
			
		КонецЕсли; 
		
		// Рекурсивный вызов.
		ОбойтиИерархиюСтатейОборотов(СтрокаТаблицы, Смета);
		
	КонецЦикла; 
	
КонецПроцедуры //ОбойтиИерархиюСтатейОборотов()
 
#КонецОбласти
